#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
google_iam_workload_identity_pool.my-wif-pool: Refreshing state... [id=projects/workload-idenity-federation/locations/global/workloadIdentityPools/my-wif-pool]
data.google_service_account.terraform-sa: Reading...
google_project_service.enable_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/cloudresourcemanager.googleapis.com]
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/iamcredentials.googleapis.com]
google_project_iam_audit_config.storage_logging: Refreshing state... [id=workload-idenity-federation/audit_config/storage.googleapis.com]
google_project_service.enable_api["sts.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/sts.googleapis.com]
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/iam.googleapis.com]
google_project_service.enable_api["storage.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/storage.googleapis.com]
data.google_service_account.terraform-sa: Read complete after 0s [id=projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=workload-idenity-federation/roles/resourcemanager.projectIamAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/iam.serviceAccountViewer"]: Refreshing state... [id=workload-idenity-federation/roles/iam.serviceAccountViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/storage.admin"]: Refreshing state... [id=workload-idenity-federation/roles/storage.admin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=workload-idenity-federation/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/serviceusage.serviceUsageViewer"]: Refreshing state... [id=workload-idenity-federation/roles/serviceusage.serviceUsageViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.my-wif-provider: Refreshing state... [id=projects/workload-idenity-federation/locations/global/workloadIdentityPools/my-wif-pool/providers/my-wif-provider]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/524220704155/locations/global/workloadIdentityPools/my-wif-pool/attribute.repository/nevenisnoob/WorkloadIdentityFederation]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.test001 will be created
  + resource "google_storage_bucket" "test001" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "workload-idenity-federation-bucket-test001"
      + project                     = "workload-idenity-federation"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @nevenisnoob, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*